{
 "key": "bridgeRoom",

 "name": "Bridge Room",

 "longDesc": "You slowly walk into the next room, trying to feel around to avoid stumbling on rocks or running into another wall.  The ceiling in this place is much taller than in the cave so you are able to stand up right.  As you continue into this new room you kick a few rocks and watch as they fall over the edge.  The floor is missing and in its place a large chasm of darkness!  You can see another room across the chasm, but you also notice light coming from above.",

 "shortDesc": "An almost empty room due to the large chasm in the middle.",

 "traps": [],

 "items": {
	"shelves": [
		{
                        "name": "Pile of Rocks",
                        "desc": "A large pile of rocks in the corner of the room.",
                        "locked": "False",
			"lock_val": "",
			"contents": []
		},
		{
                        "name": "The Edge",
                        "desc": "You look down over the edge into the abyss.  You wonder how far down it is to the bottom and what would happen if you fell.",
                        "locked": "False",
			"lock_val": "",
			"contents": []
		}
	],
	"floor": ["woodenKey"]
 },

 "doors": [
	{
		"name": "Rotted Planks",
		"desc": "To the north, a few rotted planks remain of what was once a door, now offering only the most token effort at blocking egress to the cave beyond",
		"unlock_desc": "",
		"direction": "north",
		"lock_val": "",
		"neighbor": "cave",
		"locked": "False"
	},
	{
		"name": "Steep Cliff",
		"desc": "A steep cliff lies to the east, made slick by the dampness of the air in this room- definitely a health and safety violation.",
		"unlock_desc": "You secure the end of the ladder near the top of the cliff. It should be safe to descend to the space below.",
		"direction": "east",
		"lock_val": "ladder",
		"neighbor": "rootRoom",
		"locked": "True"
	},
	{
		"name": "Hole in the Ceiling",
		"desc": "a dark hole in the ceiling leads up to something out of sight above",
		"unlock_desc": "After a few attempts, you manage to get the rope to catch on something in the hole. You're now able to ascend to the library above!",
		"direction": "up",
		"lock_val": "rope",
		"neighbor": "library",
		"locked": "True"
	}
 ]
}
