{
 "key": "bridgeRoom",

 "name": "Haunting Abyss",

 "longDesc": "You slowly walk into the next room, trying to feel around to avoid stumbling on rocks or running into another wall.\nThe ceiling in this place is much taller than in the cave so you are able to stand up right.  As you continue into this new room you kick a few rocks and watch as they fall over the edge.\n\nThe floor is missing and in its place is a large chasm of darkness!\n\nYou can see another room across the abyss, but you also notice light coming from above.",

 "shortDesc": "You have found yourself in an almost empty room due to the large chasm in the middle where the floor should be.",

 "traps": [],

 "items": {
	"shelves": [
		{
                        "name": "Pile of Rocks",
                        "desc": "There are a large pile of rocks in the corner of the room close to the edge.",
                        "locked": "False",
			"lock_val": "",
			"contents": []
		},
		{
                        "name": "Abyss",
                        "desc": "You look down over the edge into the abyss.  You wonder how far down it is to the bottom and what would happen if you fell.",
                        "locked": "False",
			"lock_val": "",
			"contents": []
		}
	],
	"floor": ["woodenKey"]
 },

 "doors": [
	{
		"name": "Rotted Planks",
		"desc": "You see the few rotted-plank remains of what was once a door, now offering only the most token effort at blocking egress to the cave beyond.",
		"unlock_desc": "",
		"direction": "north",
		"lock_val": "",
		"neighbor": "cave",
		"locked": "False"
	},
	{
		"name": "Darkness",
		"desc": "There is dampness in the air in this place- but not much else due to the gaping whole in the floor.",
		"unlock_desc": "You've secured one end of the ladder to nearby rocks and have tossed the other end across the abyss, fortunately for you it was long enough to reach.  You can cross the ladder...if you dare.\n",
		"direction": "east",
		"lock_val": "ladder",
		"neighbor": "rootRoom",
		"locked": "True"
	}
 ]
}
