{
 "key": "nexus",

 "name": "Nexus",

 "longDesc": "This large, domed room clearly had some ceremonial purpose- in the center seems to be some sort of altar, and above it, at the top of the dome, seems to be a collapsed chimney to let in natural light. There are doors leading away from here in many directions- clearly this was once some sort of hub.",

 "shortDesc": "A large, circular room with many paths leading away.",

 "items": {
	"shelves": [
		{
			"name": "Altar",
			"desc": "A large, stone altar in the center of the room.  An old, cooper box lays open atop the altar.",
			"locked": "",
			"lock_val": "",
			"contents": ["copperKey"]
		},
		{
			"name": "Suit of Armor",
			"desc": "Standing guard at the entrance to this room is a tall suit of armor made from silver that glistens in the light.",
			"locked": "",
			"lock_val": "",
			"contents": []
		}
	],
	"floor":["bucket"]
 },

 "traps": [],

 "doors": [
	{
		"name": "Stone Archway",
		"desc": "The large stone archway you remember passing through when you first entered the castle.  Maybe the enscribing was meant to be a warning?  Maybe you should have listened....",
		"unlock_desc": "",
		"direction": "south",
		"lock_val": "",
		"neighbor": "antechamber",
		"locked": "False"
	},
	{
		"name": "Glass, Double Doors",
		"desc": "A once beautiful pair of stained-glass doors framed in dark cherry wood.  Some of the glass has broken and is laying in front of them and threw the missing pieces, you can see what appears to be hundreds of books.",
		"unlock_desc": "The double doors sway gently from the breeze that finds its way down the remains of the chimney.  The smell of old books fils the room.",
		"direction": "southeast",
		"lock_val": "",
		"neighbor": "library",
		"locked": "False"
	},
	{
		"name": "Stone Door",
		"desc": "A large stone door with iron details stands before you.  Smoke bellows out from the edges as it tries to escape from whatever is hidden inside.  You can feel heat radiating from the door as you ask yourself: 'Should I even try to open this door?'",
		"unlock_desc": "",
		"direction": "north",
		"lock_val": "",
		"neighbor": "dragonRoom",
		"locked": "False"
	},
	{
		"name": "Ivy and Vines",
		"desc": "What you thought was a door was actually overgrown vines and ivy.  You try to get through them, but they have grown to be tightly too intertwined.",
		"unlock_desc": "You have cut through the ivy and vines that blocked your way into this room.",
		"direction": "northeast",
		"lock_val": "machete",
		"neighbor": "greenhouse",
		"locked": "True"
	},
	{
		"name": "Winding Stairs",
		"desc": "Well-worn, dusty stairs wind away to the northwest.",
		"unlock_desc": "",
		"direction": "northwest",
		"lock_val": "",
		"neighbor": "muralRoom",
		"locked": "False"
	},
	{
		"name": "Jade Archway",
		"desc": "An archway lies to the northeast, constructed of dark jade carved into the likeness of twisting serpents.",
		"unlock_desc": "",
		"direction": "southwest",
		"lock_val": "",
		"neighbor": "potionRoom",
		"locked": "False"
	}
 ]
}
